
Процедура КнопкаВыполнитьНажатие(Кнопка)
	ТабДокументов = ЭлементыФормы.ТабДокументов;
	СоответствиеТипов = ПолучитьТипыДокументов();
	Для Инд = 2 По ТабДокументов.ВысотаТаблицы Цикл
		ТипДокумента = "";
		ЗначПоля = ТабДокументов.Область("R" + Формат(Инд, "ЧГ=0") + "C1").Текст;
		МаксДлинаСинонима = 0;
		Для Каждого КлючЗначение Из СоответствиеТипов Цикл
			Если Найти(ЗначПоля, КлючЗначение.Значение) = 1 Тогда
				//Пример
				//"Отчет о розничных продажах 00000010620 от 26.06.2012 18:28:00"
				Если СтрДлина(КлючЗначение.Значение) > МаксДлинаСинонима Тогда
					МаксДлинаСинонима = СтрДлина(КлючЗначение.Значение);
					ТипДокумента = КлючЗначение.Ключ;
					ЗначПоля = СтрЗаменить(ЗначПоля, КлючЗначение.Значение + " ", "");
				КонецЕсли;
				//Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначПоля = "" Тогда
			Продолжить;
		КонецЕсли;
		//Пример
		//"00000010620 от 26.06.2012 18:28:00"
		ДлинаОт = Найти(ЗначПоля, " от");
		Номер = Лев(ЗначПоля, ДлинаОт - 1);
		ЗначПоля = СтрЗаменить(ЗначПоля, Номер + " от ", "");
		
		//Пример
		//"26.06.2012 18:28:00"
		
		//Мега-охеренный парсер даты
		ДатаДок = ВернутьДату(ЗначПоля, "ддММГГГГ");
		
		СсылкаДок = Документы[ТипДокумента].НайтиПоНомеру(Номер, ДатаДок);
		Сообщить(СсылкаДок);
		
		ДокОбъект = СсылкаДок.ПолучитьОбъект();
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ОбработкаПрерыванияПользователя();
		
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьТипыДокументов()
	Соотв = Новый Соответствие;
	Для Каждого ДокМетаданные Из Метаданные.Документы Цикл
		Соотв.Вставить(ДокМетаданные.Имя, ДокМетаданные.Синоним);
	КонецЦикла;
	Возврат Соотв;
КонецФункции


Функция ВернутьДату(мСтрокаДаты, Преобразование) Экспорт
	
	СтруктураПреобразования = ПолучитьСтруктуруПреобразования();
	
	МассивСимволов = Новый Массив;
	ДлСтроки = СтрДлина(мСтрокаДаты);
	Для Инд = 1 По ДлСтроки Цикл
		Симв = Сред(мСтрокаДаты, Инд, 1);
		Если Симв >= "0" И Симв <= "9" Тогда
			МассивСимволов.Добавить(Симв);
		КонецЕсли;
	КонецЦикла;
	
	КолСимволовПреобразования = СтрДлина(Преобразование);
	
	Если МассивСимволов.Количество() < КолСимволовПреобразования Тогда
		Сообщить("Строка с датой кривая!", СтатусСообщения.Важное);
		Возврат '00010101';
	КонецЕсли;
	
	//Тут можно исмользовать разные направления разбора
	Для Инд = 1 По КолСимволовПреобразования Цикл
		ИмяЧасти = Сред(Преобразование, Инд, 1);
		СтруктураПреобразования[ИмяЧасти] = "" + СтруктураПреобразования[ИмяЧасти] + МассивСимволов[Инд-1];
	КонецЦикла;
	
	ВыражениеДаты = ПривестиЧастьДаты(СтруктураПреобразования["Г"], Формат(Год(ТекущаяДата()), "ЧГ=0"))
	+ ПривестиЧастьДаты(СтруктураПреобразования["М"], "01")
	+ ПривестиЧастьДаты(СтруктураПреобразования["Д"], "01")
	+ ПривестиЧастьДаты(СтруктураПреобразования["ч"], "00")
	+ ПривестиЧастьДаты(СтруктураПреобразования["м"], "00")
	+ ПривестиЧастьДаты(СтруктураПреобразования["с"], "00");
	
	Возврат Дата(ВыражениеДаты);
	
КонецФункции

Функция ПолучитьСтруктуруПреобразования()
	
	СтруктураПреобразования = Новый Соответствие;
	СтруктураПреобразования.Вставить("Д", "");
	СтруктураПреобразования.Вставить("М", "");
	СтруктураПреобразования.Вставить("Г", "");
	СтруктураПреобразования.Вставить("ч", "");
	СтруктураПреобразования.Вставить("м", "");
	СтруктураПреобразования.Вставить("с", "");
	
	Возврат СтруктураПреобразования;
	
КонецФункции

Функция ПривестиЧастьДаты(СтрЗначение, ПоУмолчанию)
	ОтрезокШаблон = Лев(СтрЗначение, СтрДлина(ПоУмолчанию));
	Возврат Лев(ПоУмолчанию, СтрДлина(ПоУмолчанию) - СтрДлина(ОтрезокШаблон)) + ОтрезокШаблон;
КонецФункции
